sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
	// Get proper values for the validation structure indicating that we can use 
	// these EEPROM/Flash contents on future boot ups
	NVMValidationStruct.wOriginalChecksum = wOriginalAppConfigChecksum;
	NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
	NVMValidationStruct.wConfigurationLength = sizeof(APP_CONFIG);

	// Write the validation struct and current AppConfig contents to EEPROM/Flash
	#if defined(EEPROM_CS_TRIS)
	    XEEBeginWrite(0x0000);
	    XEEWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		XEEWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #elif defined(SPIRTCSRAM_CS_TRIS)
        SPISRAMBeginWrite(0x0000);
		SPISRAMWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPISRAMWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));        
    #else
		SPIFlashBeginWrite(0x0000);
		SPIFlashWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPIFlashWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
		
    #endif
}
#endif

// должна возвращать значение ускорения в зависимости от скорости
// V - скорость в градусах в сек
// L - момент инерции системы
int Calculate_A(double V, double L, double *A)
{
    double F; // частота полных шагов
    double R_G = 180/PI;
    //double dX = 1.0/200; // угол в градусах полного шага
    double Lm = 0.0;
    int i;
    // усилие на валу
    static double MPower[] = {
        0.85, 0.764642857, 0.67, 0.6, 0.53, 0.46, 0.4, 0.33, 0.22, 0.1, 0.01
    };
    // частота в Гц
    static double MaxF[] = {
        0.0, 100.0, 250.0, 500.0, 750.0, 1000.0, 1250.0, 1500.0, 1750.0, 2000.0, 2250.0
    };
    int sizeMaxF = sizeof(MaxF)/sizeof(double);
    F = V * 200;
    if(F > MaxF[sizeMaxF-1]){
        Lm = MPower[sizeMaxF-1];
    } else {
        for( i = 0; i< sizeMaxF-1; i++){
            if((F >= MaxF[i]) && (F < MaxF[i+1])){
                Lm = LinInt(MaxF[i],MPower[i],MaxF[i+1],MPower[i+1], F);
                break;
            }
        }
    }
    *A = Lm * 360 * R_G * L;
    return 0;
}

// функция возвращает время, прошедшее
// при движении с заданными параметрами на промежутке (Xbeg,Xend), 
// при начальной скорости V и ускорении A
int Calculate_dT(double Xbeg, double Xend, double V, double A, double* T)
{
    double T1 = 0.0;
    double T2 = 0.0;
    int res = 0;
    if((A==0.0)&&(V==0.0)){
        return -1; // ошибка
    }
    if((A == 0)&&(V != 0.0)){        
        *T = (Xend-Xbeg)/V;
        return 0;  // нет ошибки
    }
    // Xend = Xbeg + V*T + (A * T^2)/2
    // (A/2)T^2 + V*T + (Xbeg - Xend) = 0
    res = SolvQuadratic(A/2,V,(Xbeg-Xend),&T1, &T2); 
    if(res > 0) {
        *T = T1;
        return 0;
    }
    else return 1;
}
// вычисляет корени квадратного уравнения
int SolvQuadratic(double A, double B, double C, double* X1, double* X2)
{
    // Ax^2+Bx+C=0
    double D = 0.0f;
    double R1 = 0.0f;
    volatile double sqrtD = 0.0f;
    if((X1 == NULL) || (X2 == NULL)) return -1; // ошибка: неверные указатели
    *X1 = 0.0;
    *X2 = 0.0;
        
    if(A == 0.0){
        // Bx+C = 0
        // x = -C/B
        if(C!=0.0){
            *X1 = -B/C;
        } else {
            *X1 = 0.0;
        }
        return 1; // не квадратное уравнение, один корень
    }
    D = B*B - 4.0 * A * C;
    if(D<0.0) return 0; // дискриминант 0 корней нет
	sqrtD = sqrtf(D);
    R1 = (-B + sqrtD)/(2*A);
    *X1 = R1;
    *X2 = R1;
    //*X2 = (-B - sqrtD)/(2*A);
    return 2; // два корня уравнения
}
double LinInt(double x1,double y1,double x2,double y2, double x)
{
	if(x1!=x2) {
		return y1+(y2-y1)*(x-x1)/(x2-x1);
	}else return y1;
}

void Calc(void)
{
    {
        static double Mass = 100.0;
        static double Radius = 2.0;
        double A = 0.0; //ускорение
        double dt = 0.0; // изменение времени
        double V = 0.0;  // мгновенная скорость
        static double dX =1.0/(200.0*16.0);// шаг перемещения в градусах (в 1 градусе 3200 шагов)
        double X = 0.0;    // полное перемещение в градусах
        volatile double T = 0.0;    // полное время
        volatile DWORD timer1 = 0;  // значение таймера 
        volatile DWORD i = 0;  
        double L = 2.0/(Mass*Radius*Radius); 
        
        do{
            Calculate_A(V, L ,&A);
            Calculate_dT(0, dX, V, A, &dt);
            V = dX/dt;
            //X += dX;
            T += dt;
            timer1 = (DWORD)(T/0.0000002); // результат вычислений            
            i++;
        }while ( i < 288000);
        //i = 0
        //T = 0;
        //do{
        //    Calculate_A(V, 2/(Mass*Radius*Radius),&A);
        //    A = -A;
        //    if(Calculate_dT(0, dX, V, A, &dt)!=0){
        //        V=0;
        //    } else
        //    V = dX/dt;
            //X += dX;
        //    T += dt;
        //    timer1 = T/0.0000002; // результат вычислений
        //    i++;
        //}while ( i < 64);
    }
}
